test-results/legacy30aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Thread Group:geographic-insights-by-region,1575,3076,2912,3975,4397,5348,2037,6519,0.000%,3.36199,809.59,1.33
Thread Group:geographic-insights-by-territory,1568,782,710,1014,1180,1757,565,3617,0.000%,3.38803,53.18,1.35
Thread Group:demographic_insights,1563,620,566,800,897,1494,461,2684,0.000%,3.38594,8.36,1.31
Thread Group:stream-charts,1562,1016,916,1406,1640,2172,682,3250,0.000%,3.38198,26.79,1.34
Thread Group:playlist-metadata,1559,640,585,829,985,1563,460,3516,0.000%,3.38523,3.11,2.20
Thread Group:playlist-placements,1553,624,568,789,912,1557,456,2701,0.000%,3.37983,2.84,1.39
Thread Group:geographics-latest-date,1553,623,572,805,931,1372,454,2200,0.000%,3.38074,0.89,1.13
Thread Group:geographic-orchard-regions,1551,1475,1369,1887,2092,2805,1037,6490,0.000%,3.37458,351.02,1.20
TOTAL,12484,1109,733,2549,3094,4161,454,6519,0.000%,26.64834,1247.88,11.08