test-results/legacy3aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
geographic-insights-by-region,149,2613,2398,3339,3756,4523,2158,5553,0.000%,.38414,92.50,0.15
geographic-insights-by-territory,148,690,616,865,998,1819,563,2589,0.000%,.38902,6.11,0.15
demographic_insights,148,536,500,624,757,1041,451,1118,0.000%,.38955,0.96,0.15
stream-charts,148,965,851,1304,1534,1945,696,1988,0.000%,.38934,3.08,0.15
playlist-metadata,147,557,502,720,799,1372,454,1640,0.000%,.38961,0.36,0.25
playlist-placements,147,540,495,682,804,1030,454,1041,0.000%,.38961,0.33,0.16
geographics-latest-date,147,540,500,670,759,924,453,1321,0.000%,.38974,0.10,0.13
geographic-orchard-regions,146,1349,1259,1595,1866,2570,1002,3353,0.000%,.38940,40.50,0.14
TOTAL,1180,976,624,2288,2554,3407,451,5553,0.000%,3.04216,142.38,1.26